module.exports = {
    base: '/leetcode/',
    title: 'JavaScript实现的一些算法题', 
    description: 'JavaScript实现的一些算法题',
    head: [
        ['link', { rel: 'icon', href: 'https://cdn.wangyaxing.cn/icon-128x128.png' }],
    ],
    themeConfig: {
        nav: [
            { text: 'home', link: '/' },
            { text: '算法基础知识', link: '/basic/' },
            { text: 'leetcode', link: '/leetcode/' },
            { text: '剑指offer', link: '/Sword_offer/' },
            { text: 'Github', link: 'https://github.com/funnycoderstar/leetcode' },
        ],
        sidebar: {
            '/basic/': [
                {
                    title: '算法基础知识',
                    collapsable: true,
                    children: [
                        ['binarySearchTree', '二叉搜索树'],
                        ['binaryTree', '树'],
                        ['BitwiseOperators', '按位操作符'],
                    ]
                }
                
            ],
            '/leetcode/': [
                {
                    title: 'leetcode',
                    collapsable: true,
                    children:[
                        ['20.md', '20. 有效的括号'],
                        ['32', '32. 最长有效括号'],
                        ['1021', '1021. 删除最外层的括号'],
                        ['11', '11. 盛最多水的容器'],
                        ['42', '42. 接雨水'],
                        ['1094-carPooling', '1094. 拼车'],
                        ['1104-distributeCandies', '1104. 分糖果 II'],
                    ],
                }
            ],
            '/Sword_offer/': [
                {
                    title: '剑指offer',
                    collapsable: true,
                    children:[
                        ['1', '1.二维数组中的查找'],
                        ['2', '2.替换空格'],
                        ['3', '3.从尾到头打印链表'],
                        ['4', '4.重建二叉树'],
                        ['5', '5.用两个栈实现队列'],
                        ['6', '6.旋转数组的最小数字'],
                        ['7', '7.斐波那契数列I'],
                        ['8', '8.跳台阶'],
                        ['9', '9.变态跳台阶'],
                        ['10', '10.矩形覆盖'],
                        ['11', '11.二进制中1的个数'],
                        ['12', '12.数值的整数次方'],
                        ['13', '13.调整数组顺序使奇数位于偶数前面'],
                        ['21', '21.栈的压入、弹出序列'],
                        ['22', '22.从上往下打印二叉树'],
                        ['23', '23.二叉搜索树的后序遍历序列'],
                        ['24', '24.二叉树中和为某一值的路径'],
                        ['25', '25.复杂链表的复制'],
                        ['26', '26.二叉搜索树与双向链表'],
                        ['30', '30.扑克牌顺子'],
                        ['31', '31.整数中1出现的次数(从1到n整数中1出现的次数)'],
                        ['33', '33.丑数'],
                        ['35', '35.数组中的逆序对'],
                        ['40', '40.和为S的连续正数序列'],
                        ['41', '41.和为S的两个数字'],
                        ['42', '42.左旋转字符串'],
                        ['43', '43.翻转单词顺序列]'],
                        ['44', '44.孩子们的游戏(圆圈中最后剩下的数)'],
                        ['47', '47.不用加减乘除做加法'],
                        ['48', '48.把字符串转换成整数'],
                        ['49', '49.数组中重复的数字'],
                        ['50', '50.构建乘积数组'],
                        ['51', '51.正则表达式匹配'],
                        ['53', '52.表示数值的字符串'],
                        ['53', '53.字符流中第一个不重复的字符'],
                        ['54', '54.链表中环的入口结点'],
                        ['55', '55.删除链表中重复的结点'],
                        ['57', '57.对称的二叉树'],
                        ['58', '58.按之字形顺序打印二叉树'],
                        ['59', '59.把二叉树打印成多行'],
                        ['60', '60.滑动窗口的最大值'],
                        ['65', '65.矩阵中的路径'],
                        ['66', '66.机器人的运动范围'],
                    ],
                }
            ],

        }
    }
}